HloModule jit_train_step, is_scheduled=true, input_output_alias={ {0}: (3, {}, may-alias), {1}: (0, {}, may-alias), {2}: (1, {}, may-alias), {3}: (2, {}, may-alias), {4}: (13, {}, may-alias), {5}: (4, {}, may-alias), {6}: (5, {}, may-alias), {7}: (6, {}, may-alias), {8}: (7, {}, may-alias), {9}: (8, {}, may-alias), {10}: (9, {}, may-alias), {11}: (10, {}, may-alias), {12}: (11, {}, may-alias), {13}: (12, {}, may-alias), {14}: (17, {}, may-alias), {15}: (14, {}, may-alias), {16}: (15, {}, may-alias), {17}: (16, {}, may-alias), {18}: (30, {}, may-alias), {19}: (18, {}, may-alias), {20}: (19, {}, may-alias), {21}: (20, {}, may-alias), {22}: (21, {}, may-alias), {23}: (22, {}, may-alias), {24}: (23, {}, may-alias), {25}: (24, {}, may-alias), {26}: (25, {}, may-alias), {27}: (26, {}, may-alias), {28}: (27, {}, may-alias), {29}: (28, {}, may-alias), {30}: (29, {}, may-alias), {32}: (31, {}, may-alias), {33}: (32, {}, may-alias), {34}: (33, {}, may-alias), {35}: (34, {}, may-alias), {36}: (35, {}, may-alias), {37}: (36, {}, may-alias), {38}: (37, {}, may-alias), {39}: (38, {}, may-alias), {40}: (39, {}, may-alias) }, entry_computation_layout={(bf16[128256,512]{1,0:T(8,128)(2,1)}, bf16[16032,4096]{1,0:T(8,128)(2,1)}, bf16[512]{0:T(512)(128)(2,1)}, f32[64]{0:T(128)}, bf16[32,512]{1,0:T(8,128)(2,1)}, /*index=5*/bf16[32,512,14336]{2,1,0:T(8,128)(2,1)}, bf16[32,14336,512]{2,1,0:T(8,128)(2,1)}, bf16[32,14336,512]{2,1,0:T(8,128)(2,1)}, bf16[32,512]{1,0:T(8,128)(2,1)}, bf16[32,1024,512]{2,1,0:T(8,128)(2,1)}, /*index=10*/bf16[32,512,4096]{2,1,0:T(8,128)(2,1)}, bf16[32,4096,512]{2,1,0:T(8,128)(2,1)}, bf16[32,1024,512]{2,1,0:T(8,128)(2,1)}, s32[]{:T(128)}, f32[128256,512]{1,0:T(8,128)}, /*index=15*/f32[16032,4096]{1,0:T(8,128)}, f32[512]{0:T(512)}, f32[64]{0:T(128)}, f32[32,512]{1,0:T(8,128)}, f32[32,512,14336]{2,1,0:T(8,128)}, /*index=20*/f32[32,14336,512]{2,1,0:T(8,128)}, f32[32,14336,512]{2,1,0:T(8,128)}, f32[32,512]{1,0:T(8,128)}, f32[32,1024,512]{2,1,0:T(8,128)}, f32[32,512,4096]{2,1,0:T(8,128)}, /*index=25*/f32[32,4096,512]{2,1,0:T(8,128)}, f32[32,1024,512]{2,1,0:T(8,128)}, bf16[128256,512]{1,0:T(8,128)(2,1)}, bf16[16032,4096]{1,0:T(8,128)(2,1)}, bf16[512]{0:T(512)(128)(2,1)}, /*index=30*/f32[64]{0:T(128)}, bf16[32,512]{1,0:T(8,128)(2,1)}, bf16[32,512,14336]{2,1,0:T(8,128)(2,1)}, bf16[32,14336,512]{2,1,0:T(8,128)(2,1)}, bf16[32,14336,512]{2,1,0:T(8,128)(2,1)}, /*index=35*/bf16[32,512]{1,0:T(8,128)(2,1)}, bf16[32,1024,512]{2,1,0:T(8,128)(2,1)}, bf16[32,512,4096]{2,1,0:T(8,128)(2,1)}, bf16[32,4096,512]{2,1,0:T(8,128)(2,1)}, bf16[32,1024,512]{2,1,0:T(8,128)(2,1)}, /*index=40*/s32[4,8192]{1,0:T(4,128)}, s32[4,8192]{1,0:T(4,128)})->(f32[]{:T(128)}, bf16[128256,512]{1,0:T(8,128)(2,1)}, bf16[16032,4096]{1,0:T(8,128)(2,1)}, bf16[512]{0:T(512)(128)(2,1)}, f32[64]{0:T(128)}, /*index=5*/bf16[32,512]{1,0:T(8,128)(2,1)}, bf16[32,512,14336]{2,1,0:T(8,128)(2,1)}, bf16[32,14336,512]{2,1,0:T(8,128)(2,1)}, bf16[32,14336,512]{2,1,0:T(8,128)(2,1)}, bf16[32,512]{1,0:T(8,128)(2,1)}, /*index=10*/bf16[32,1024,512]{2,1,0:T(8,128)(2,1)}, bf16[32,512,4096]{2,1,0:T(8,128)(2,1)}, bf16[32,4096,512]{2,1,0:T(8,128)(2,1)}, bf16[32,1024,512]{2,1,0:T(8,128)(2,1)}, s32[]{:T(128)}, /*index=15*/f32[128256,512]{1,0:T(8,128)}, f32[16032,4096]{1,0:T(8,128)}, f32[512]{0:T(512)}, f32[64]{0:T(128)}, f32[32,512]{1,0:T(8,128)}, /*index=20*/f32[32,512,14336]{2,1,0:T(8,128)}, f32[32,14336,512]{2,1,0:T(8,128)}, f32[32,14336,512]{2,1,0:T(8,128)}, f32[32,512]{1,0:T(8,128)}, f32[32,1024,512]{2,1,0:T(8,128)}, /*index=25*/f32[32,512,4096]{2,1,0:T(8,128)}, f32[32,4096,512]{2,1,0:T(8,128)}, f32[32,1024,512]{2,1,0:T(8,128)}, bf16[128256,512]{1,0:T(8,128)(2,1)}, bf16[16032,4096]{1,0:T(8,128)(2,1)}, /*index=30*/bf16[512]{0:T(512)(128)(2,1)}, f32[64]{0:T(128)}, bf16[32,512]{1,0:T(8,128)(2,1)}, bf16[32,512,14336]{2,1,0:T(8,128)(2,1)}, bf16[32,14336,512]{2,1,0:T(8,128)(2,1)}, /*index=35*/bf16[32,14336,512]{2,1,0:T(8,128)(2,1)}, bf16[32,512]{1,0:T(8,128)(2,1)}, bf16[32,1024,512]{2,1,0:T(8,128)(2,1)}, bf16[32,512,4096]{2,1,0:T(8,128)(2,1)}, bf16[32,4096,512]{2,1,0:T(8,128)(2,1)}, /*index=40*/bf16[32,1024,512]{2,1,0:T(8,128)(2,1)})}, allow_spmd_sharding_propagation_to_parameters={false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false,false}, allow_spmd_sharding_propagation_to_output={true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true,true}, num_partitions=8

FileNames
1 "/app/trainer/train.py"
2 "/opt/venv/lib/python3.12/site-packages/fire/core.py"
3 "/app/trainer/model/modeling_llama3.py"
4 "/app/trainer/splash_attn.py"
5 "/app/trainer/tokamax_lib/tokamax/_src/ops/experimental/tpu/splash_attention/splash_attention_kernel.py"
6 "/app/trainer/tokamax_lib/tokamax/_src/ops/experimental/tpu/splash_attention/splash_attention_mask_info.py"
7 "/app/trainer/tokamax_lib/tokamax/_src/ops/linear_softmax_cross_entropy_loss/api.py"
8 "/app/trainer/tokamax_lib/tokamax/_src/ops/op.py"
9 "/app/trainer/tokamax_lib/tokamax/_src/batching.py"
10 "/app/trainer/tokamax_lib/tokamax/_src/ops/linear_softmax_cross_entropy_loss/chunked_xla.py"
11 "/opt/venv/lib/python3.12/site-packages/optax/_src/update.py"
12 "/opt/venv/lib/python3.12/site-packages/optax/transforms/_combining.py"
13 "/opt/venv/lib/python3.12/site-packages/optax/_src/base.py"
14 "/opt/venv/lib/python3.12/site-packages/optax/_src/transform.py"
15 "/opt/venv/lib/python3.12/site-packages/optax/tree_utils/_tree_math.py"
16 "/opt/venv/lib/python3.12/site-packages/optax/_src/numerics.py"
17 "/opt/venv/lib/python3.12/site-packages/optax/transforms/_adding.py"

FunctionNames
1 "<module>"
2 "Fire"
3 "_Fire"
4 "_CallAndUpdateTrace"
5 "main"
6 "main.<locals>.train_step"
7 "main.<locals>.loss_fn"
8 "LlamaForCausalLMScan.__call__"
9 "LlamaEmbedding.__call__"
10 "LlamaForCausalLMScan.__call__.<locals>.body"
11 "_decoder_call"
12 "_attn_splash"
13 "tpu_splash_attention"
14 "tpu_splash_attention.<locals>.wrap_flash_attention"
15 "SplashAttentionKernel.__call__"
16 "_splash_attention"
17 "_splash_attention_custom"
18 "_splash_attention_forward"
19 "find_bounds"
20 "_splash_attention_forward.<locals>.init_if_empty"
21 "LlamaRotaryEmbedding.__call__"
22 "_decoder_call.<locals>._rmsnorm"
23 "_decoder_call.<locals>._matmul"
24 "apply_rotary_pos_emb"
25 "_rotate_half"
26 "LlamaRMSNorm.__call__"
27 "main.<locals>._ce_tokamax"
28 "main.<locals>._ce_tokamax.<locals>._ce_local"
29 "linear_softmax_cross_entropy_loss"
30 "Op.__call__"
31 "capture_batched_args.<locals>.wrapped"
32 "capture_batched_args.<locals>.wrapped.<locals>.fn_flat"
33 "Op.__call__.<locals>.fwd"
34 "ChunkedXlaLinearSoftmaxCrossEntropyLoss._fwd"
35 "linear_softmax_cross_entropy_loss_fwd_chunked_xla"
36 "linear_softmax_cross_entropy_loss_fwd_chunked_xla.<locals>.b_loop_body"
37 "linear_softmax_cross_entropy_loss_fwd_chunked_xla.<locals>.b_loop_body.<locals>.v_loop_body"
38 "apply_updates"
39 "apply_updates.<locals>.<lambda>"
40 "chain.<locals>.update_fn"
41 "with_extra_args_support.<locals>.update"
42 "scale_by_adam.<locals>.update_fn"
43 "tree_update_moment"
44 "tree_update_moment.<locals>.<lambda>"
45 "safe_increment"
46 "tree_update_moment_per_elem_norm"
47 "tree_update_moment_per_elem_norm.<locals>.<lambda>"
48 "tree_update_moment_per_elem_norm.<locals>.orderth_norm"
49 "scale_by_adam.<locals>.update_fn.<locals>.<lambda>"
50 "add_decayed_weights.<locals>.update_fn"
51 "add_decayed_weights.<locals>.update_fn.<locals>.<lambda>"
52 "scale.<locals>.update_fn"
53 "scale.<locals>.update_fn.<locals>.<lambda>"

FileLocations
1 {file_name_id=1 function_name_id=1 line=562 end_line=562 column=4 end_column=4}
2 {file_name_id=2 function_name_id=2 line=135 end_line=135 column=20 end_column=20}
3 {file_name_id=2 function_name_id=3 line=468 end_line=468 column=36 end_column=36}
4 {file_name_id=2 function_name_id=4 line=684 end_line=684 column=16 end_column=16}
5 {file_name_id=1 function_name_id=5 line=495 end_line=495 column=33 end_column=33}
6 {file_name_id=1 function_name_id=6 line=449 end_line=449 column=30 end_column=30}
7 {file_name_id=1 function_name_id=7 line=436 end_line=436 column=21 end_column=21}
8 {file_name_id=3 function_name_id=8 line=946 end_line=946 column=17 end_column=17}
9 {file_name_id=3 function_name_id=9 line=226 end_line=226 column=14 end_column=14}
10 {file_name_id=3 function_name_id=8 line=975 end_line=975 column=20 end_column=20}
11 {file_name_id=3 function_name_id=10 line=965 end_line=965 column=25 end_column=25}
12 {file_name_id=3 function_name_id=11 line=843 end_line=843 column=19 end_column=19}
13 {file_name_id=3 function_name_id=12 line=406 end_line=406 column=11 end_column=11}
14 {file_name_id=4 function_name_id=13 line=191 end_line=191 column=6 end_column=6}
15 {file_name_id=4 function_name_id=14 line=175 end_line=175 column=11 end_column=11}
16 {file_name_id=5 function_name_id=15 line=1964 end_line=1964 column=11 end_column=11}
17 {file_name_id=5 function_name_id=16 line=1931 end_line=1931 column=9 end_column=9}
18 {file_name_id=5 function_name_id=17 line=986 end_line=986 column=8 end_column=8}
19 {file_name_id=5 function_name_id=18 line=556 end_line=556 column=29 end_column=29}
20 {file_name_id=6 function_name_id=19 line=42 end_line=42 column=25 end_column=25}
21 {file_name_id=6 function_name_id=19 line=43 end_line=43 column=23 end_column=23}
22 {file_name_id=5 function_name_id=18 line=910 end_line=910 column=8 end_column=8}
23 {file_name_id=5 function_name_id=20 line=908 end_line=908 column=11 end_column=11}
24 {file_name_id=3 function_name_id=8 line=948 end_line=948 column=44 end_column=44}
25 {file_name_id=3 function_name_id=8 line=949 end_line=949 column=19 end_column=19}
26 {file_name_id=3 function_name_id=21 line=273 end_line=273 column=14 end_column=14}
27 {file_name_id=3 function_name_id=21 line=275 end_line=275 column=16 end_column=16}
28 {file_name_id=3 function_name_id=21 line=276 end_line=276 column=14 end_column=14}
29 {file_name_id=3 function_name_id=21 line=277 end_line=277 column=14 end_column=14}
30 {file_name_id=3 function_name_id=21 line=279 end_line=279 column=15 end_column=15}
31 {file_name_id=3 function_name_id=21 line=278 end_line=278 column=14 end_column=14}
32 {file_name_id=3 function_name_id=21 line=279 end_line=279 column=34 end_column=34}
33 {file_name_id=3 function_name_id=11 line=828 end_line=828 column=8 end_column=8}
34 {file_name_id=3 function_name_id=22 line=804 end_line=804 column=14 end_column=14}
35 {file_name_id=3 function_name_id=22 line=806 end_line=806 column=21 end_column=21}
36 {file_name_id=3 function_name_id=22 line=806 end_line=806 column=12 end_column=12}
37 {file_name_id=3 function_name_id=22 line=805 end_line=805 column=20 end_column=20}
38 {file_name_id=3 function_name_id=22 line=808 end_line=808 column=16 end_column=16}
39 {file_name_id=3 function_name_id=22 line=808 end_line=808 column=34 end_column=34}
40 {file_name_id=3 function_name_id=22 line=808 end_line=808 column=15 end_column=15}
41 {file_name_id=3 function_name_id=11 line=830 end_line=830 column=14 end_column=14}
42 {file_name_id=3 function_name_id=23 line=816 end_line=816 column=15 end_column=15}
43 {file_name_id=3 function_name_id=11 line=832 end_line=832 column=8 end_column=8}
44 {file_name_id=3 function_name_id=11 line=839 end_line=839 column=11 end_column=11}
45 {file_name_id=3 function_name_id=24 line=81 end_line=81 column=12 end_column=12}
46 {file_name_id=3 function_name_id=24 line=81 end_line=81 column=24 end_column=24}
47 {file_name_id=3 function_name_id=25 line=66 end_line=66 column=9 end_column=9}
48 {file_name_id=3 function_name_id=25 line=67 end_line=67 column=28 end_column=28}
49 {file_name_id=3 function_name_id=25 line=65 end_line=65 column=9 end_column=9}
50 {file_name_id=3 function_name_id=25 line=67 end_line=67 column=11 end_column=11}
51 {file_name_id=3 function_name_id=24 line=81 end_line=81 column=11 end_column=11}
52 {file_name_id=3 function_name_id=11 line=833 end_line=833 column=14 end_column=14}
53 {file_name_id=3 function_name_id=11 line=835 end_line=835 column=8 end_column=8}
54 {file_name_id=3 function_name_id=24 line=81 end_line=81 column=49 end_column=49}
55 {file_name_id=3 function_name_id=24 line=81 end_line=81 column=61 end_column=61}
56 {file_name_id=3 function_name_id=24 line=81 end_line=81 column=48 end_column=48}
57 {file_name_id=3 function_name_id=11 line=836 end_line=836 column=14 end_column=14}
58 {file_name_id=3 function_name_id=11 line=838 end_line=838 column=8 end_column=8}
59 {file_name_id=3 function_name_id=11 line=849 end_line=849 column=15 end_column=15}
60 {file_name_id=3 function_name_id=11 line=850 end_line=850 column=21 end_column=21}
61 {file_name_id=3 function_name_id=11 line=851 end_line=851 column=13 end_column=13}
62 {file_name_id=3 function_name_id=11 line=854 end_line=854 column=8 end_column=8}
63 {file_name_id=3 function_name_id=11 line=856 end_line=856 column=14 end_column=14}
64 {file_name_id=3 function_name_id=11 line=859 end_line=859 column=16 end_column=16}
65 {file_name_id=3 function_name_id=11 line=857 end_line=857 column=14 end_column=14}
66 {file_name_id=3 function_name_id=11 line=859 end_line=859 column=8 end_column=8}
67 {file_name_id=3 function_name_id=11 line=862 end_line=862 column=11 end_column=11}
68 {file_name_id=3 function_name_id=8 line=976 end_line=976 column=17 end_column=17}
69 {file_name_id=3 function_name_id=26 line=132 end_line=132 column=14 end_column=14}
70 {file_name_id=3 function_name_id=26 line=134 end_line=134 column=21 end_column=21}
71 {file_name_id=3 function_name_id=26 line=134 end_line=134 column=12 end_column=12}
72 {file_name_id=3 function_name_id=26 line=133 end_line=133 column=20 end_column=20}
73 {file_name_id=3 function_name_id=26 line=136 end_line=136 column=16 end_column=16}
74 {file_name_id=3 function_name_id=26 line=136 end_line=136 column=34 end_column=34}
75 {file_name_id=3 function_name_id=26 line=136 end_line=136 column=15 end_column=15}
76 {file_name_id=1 function_name_id=7 line=438 end_line=438 column=19 end_column=19}
77 {file_name_id=1 function_name_id=27 line=397 end_line=397 column=14 end_column=14}
78 {file_name_id=1 function_name_id=27 line=391 end_line=391 column=17 end_column=17}
79 {file_name_id=1 function_name_id=27 line=398 end_line=398 column=14 end_column=14}
80 {file_name_id=1 function_name_id=27 line=420 end_line=420 column=15 end_column=15}
81 {file_name_id=1 function_name_id=28 line=405 end_line=405 column=24 end_column=24}
82 {file_name_id=7 function_name_id=29 line=100 end_line=100 column=13 end_column=13}
83 {file_name_id=8 function_name_id=30 line=293 end_line=293 column=11 end_column=11}
84 {file_name_id=9 function_name_id=31 line=213 end_line=213 column=11 end_column=11}
85 {file_name_id=9 function_name_id=32 line=191 end_line=191 column=13 end_column=13}
86 {file_name_id=8 function_name_id=33 line=243 end_line=243 column=25 end_column=25}
87 {file_name_id=10 function_name_id=34 line=305 end_line=305 column=16 end_column=16}
88 {file_name_id=10 function_name_id=35 line=156 end_line=156 column=7 end_column=7}
89 {file_name_id=10 function_name_id=35 line=96 end_line=96 column=13 end_column=13}
90 {file_name_id=10 function_name_id=35 line=152 end_line=152 column=22 end_column=22}
91 {file_name_id=10 function_name_id=36 line=136 end_line=136 column=12 end_column=12}
92 {file_name_id=10 function_name_id=36 line=137 end_line=137 column=12 end_column=12}
93 {file_name_id=10 function_name_id=36 line=106 end_line=106 column=14 end_column=14}
94 {file_name_id=10 function_name_id=36 line=131 end_line=131 column=35 end_column=35}
95 {file_name_id=10 function_name_id=37 line=112 end_line=112 column=12 end_column=12}
96 {file_name_id=10 function_name_id=37 line=111 end_line=111 column=17 end_column=17}
97 {file_name_id=10 function_name_id=37 line=110 end_line=110 column=16 end_column=16}
98 {file_name_id=10 function_name_id=37 line=113 end_line=113 column=12 end_column=12}
99 {file_name_id=10 function_name_id=37 line=114 end_line=114 column=18 end_column=18}
100 {file_name_id=10 function_name_id=37 line=119 end_line=119 column=18 end_column=18}
101 {file_name_id=10 function_name_id=37 line=118 end_line=118 column=16 end_column=16}
102 {file_name_id=10 function_name_id=37 line=124 end_line=124 column=10 end_column=10}
103 {file_name_id=10 function_name_id=37 line=123 end_line=123 column=23 end_column=23}
104 {file_name_id=10 function_name_id=37 line=127 end_line=127 column=10 end_column=10}
105 {file_name_id=10 function_name_id=37 line=126 end_line=126 column=57 end_column=57}
106 {file_name_id=10 function_name_id=37 line=126 end_line=126 column=32 end_column=32}
107 {file_name_id=10 function_name_id=36 line=148 end_line=148 column=14 end_column=14}
108 {file_name_id=10 function_name_id=36 line=142 end_line=142 column=13 end_column=13}
109 {file_name_id=10 function_name_id=36 line=143 end_line=143 column=13 end_column=13}
110 {file_name_id=10 function_name_id=36 line=145 end_line=145 column=28 end_column=28}
111 {file_name_id=10 function_name_id=36 line=149 end_line=149 column=16 end_column=16}
112 {file_name_id=10 function_name_id=36 line=146 end_line=146 column=19 end_column=19}
113 {file_name_id=10 function_name_id=36 line=149 end_line=149 column=49 end_column=49}
114 {file_name_id=10 function_name_id=36 line=149 end_line=149 column=4 end_column=4}
115 {file_name_id=1 function_name_id=28 line=412 end_line=412 column=19 end_column=19}
116 {file_name_id=1 function_name_id=6 line=452 end_line=452 column=24 end_column=24}
117 {file_name_id=11 function_name_id=38 line=41 end_line=41 column=9 end_column=9}
118 {file_name_id=11 function_name_id=39 line=43 end_line=43 column=45 end_column=45}
119 {file_name_id=1 function_name_id=6 line=451 end_line=451 column=37 end_column=37}
120 {file_name_id=12 function_name_id=40 line=90 end_line=90 column=23 end_column=23}
121 {file_name_id=13 function_name_id=41 line=336 end_line=336 column=11 end_column=11}
122 {file_name_id=14 function_name_id=42 line=283 end_line=283 column=9 end_column=9}
123 {file_name_id=15 function_name_id=43 line=355 end_line=355 column=9 end_column=9}
124 {file_name_id=15 function_name_id=44 line=357 end_line=357 column=10 end_column=10}
125 {file_name_id=15 function_name_id=44 line=357 end_line=357 column=37 end_column=37}
126 {file_name_id=14 function_name_id=42 line=285 end_line=285 column=16 end_column=16}
127 {file_name_id=16 function_name_id=45 line=142 end_line=142 column=19 end_column=19}
128 {file_name_id=16 function_name_id=45 line=142 end_line=142 column=38 end_column=38}
129 {file_name_id=16 function_name_id=45 line=142 end_line=142 column=9 end_column=9}
130 {file_name_id=14 function_name_id=42 line=294 end_line=294 column=15 end_column=15}
131 {file_name_id=14 function_name_id=42 line=284 end_line=284 column=9 end_column=9}
132 {file_name_id=15 function_name_id=46 line=390 end_line=390 column=9 end_column=9}
133 {file_name_id=15 function_name_id=47 line=392 end_line=392 column=24 end_column=24}
134 {file_name_id=15 function_name_id=48 line=382 end_line=382 column=13 end_column=13}
135 {file_name_id=15 function_name_id=47 line=392 end_line=392 column=10 end_column=10}
136 {file_name_id=14 function_name_id=42 line=298 end_line=298 column=13 end_column=13}
137 {file_name_id=14 function_name_id=42 line=299 end_line=299 column=14 end_column=14}
138 {file_name_id=14 function_name_id=49 line=300 end_line=300 column=49 end_column=49}
139 {file_name_id=14 function_name_id=49 line=300 end_line=300 column=44 end_column=44}
140 {file_name_id=17 function_name_id=50 line=64 end_line=64 column=14 end_column=14}
141 {file_name_id=17 function_name_id=51 line=65 end_line=65 column=48 end_column=48}
142 {file_name_id=17 function_name_id=51 line=65 end_line=65 column=44 end_column=44}
143 {file_name_id=14 function_name_id=52 line=467 end_line=467 column=14 end_column=14}
144 {file_name_id=14 function_name_id=53 line=467 end_line=467 column=37 end_column=37}
145 {file_name_id=11 function_name_id=39 line=43 end_line=43 column=33 end_column=33}
146 {file_name_id=15 function_name_id=47 line=392 end_line=392 column=42 end_column=42}

StackFrames
1 {file_location_id=1 parent_frame_id=0}
2 {file_location_id=2 parent_frame_id=1}
3 {file_location_id=3 parent_frame_id=2}
4 {file_location_id=4 parent_frame_id=3}
5 {file_location_id=5 parent_frame_id=4}
6 {file_location_id=6 parent_frame_id=5}
7 {file_location_id=7 parent_frame_id=6}
8 {file_location_id=8 parent_frame_id=7}
9 {file_location_id=9 parent_frame_id=8}
10 {file_location_id=10 parent_frame_id=7}
11 {file_location_id=3 parent_frame_id=0}
12 {file_location_id=4 parent_frame_id=11}
13 {file_location_id=5 parent_frame_id=12}
14 {file_location_id=6 parent_frame_id=13}
15 {file_location_id=7 parent_frame_id=14}
16 {file_location_id=10 parent_frame_id=15}
17 {file_location_id=11 parent_frame_id=16}
18 {file_location_id=12 parent_frame_id=17}
19 {file_location_id=13 parent_frame_id=18}
20 {file_location_id=14 parent_frame_id=19}
21 {file_location_id=11 parent_frame_id=0}
22 {file_location_id=12 parent_frame_id=21}
23 {file_location_id=13 parent_frame_id=22}
24 {file_location_id=14 parent_frame_id=23}
25 {file_location_id=15 parent_frame_id=24}
26 {file_location_id=16 parent_frame_id=25}
27 {file_location_id=17 parent_frame_id=26}
28 {file_location_id=18 parent_frame_id=27}
29 {file_location_id=19 parent_frame_id=28}
30 {file_location_id=20 parent_frame_id=29}
31 {file_location_id=6 parent_frame_id=0}
32 {file_location_id=7 parent_frame_id=31}
33 {file_location_id=10 parent_frame_id=32}
34 {file_location_id=11 parent_frame_id=33}
35 {file_location_id=12 parent_frame_id=34}
36 {file_location_id=13 parent_frame_id=35}
37 {file_location_id=14 parent_frame_id=36}
38 {file_location_id=15 parent_frame_id=37}
39 {file_location_id=16 parent_frame_id=38}
40 {file_location_id=17 parent_frame_id=39}
41 {file_location_id=21 parent_frame_id=29}
42 {file_location_id=22 parent_frame_id=28}
43 {file_location_id=23 parent_frame_id=42}
44 {file_location_id=24 parent_frame_id=7}
45 {file_location_id=25 parent_frame_id=7}
46 {file_location_id=26 parent_frame_id=45}
47 {file_location_id=27 parent_frame_id=45}
48 {file_location_id=28 parent_frame_id=45}
49 {file_location_id=29 parent_frame_id=45}
50 {file_location_id=30 parent_frame_id=45}
51 {file_location_id=31 parent_frame_id=45}
52 {file_location_id=32 parent_frame_id=45}
53 {file_location_id=2 parent_frame_id=0}
54 {file_location_id=3 parent_frame_id=53}
55 {file_location_id=4 parent_frame_id=54}
56 {file_location_id=5 parent_frame_id=55}
57 {file_location_id=6 parent_frame_id=56}
58 {file_location_id=7 parent_frame_id=57}
59 {file_location_id=10 parent_frame_id=58}
60 {file_location_id=11 parent_frame_id=59}
61 {file_location_id=33 parent_frame_id=60}
62 {file_location_id=34 parent_frame_id=61}
63 {file_location_id=35 parent_frame_id=61}
64 {file_location_id=36 parent_frame_id=61}
65 {file_location_id=37 parent_frame_id=61}
66 {file_location_id=38 parent_frame_id=61}
67 {file_location_id=39 parent_frame_id=61}
68 {file_location_id=40 parent_frame_id=61}
69 {file_location_id=41 parent_frame_id=60}
70 {file_location_id=42 parent_frame_id=69}
71 {file_location_id=11 parent_frame_id=10}
72 {file_location_id=43 parent_frame_id=71}
73 {file_location_id=44 parent_frame_id=60}
74 {file_location_id=45 parent_frame_id=73}
75 {file_location_id=44 parent_frame_id=17}
76 {file_location_id=46 parent_frame_id=75}
77 {file_location_id=47 parent_frame_id=76}
78 {file_location_id=48 parent_frame_id=76}
79 {file_location_id=49 parent_frame_id=76}
80 {file_location_id=50 parent_frame_id=76}
81 {file_location_id=46 parent_frame_id=73}
82 {file_location_id=51 parent_frame_id=73}
83 {file_location_id=52 parent_frame_id=60}
84 {file_location_id=42 parent_frame_id=83}
85 {file_location_id=53 parent_frame_id=71}
86 {file_location_id=54 parent_frame_id=73}
87 {file_location_id=55 parent_frame_id=75}
88 {file_location_id=47 parent_frame_id=87}
89 {file_location_id=48 parent_frame_id=87}
90 {file_location_id=49 parent_frame_id=87}
91 {file_location_id=50 parent_frame_id=87}
92 {file_location_id=55 parent_frame_id=73}
93 {file_location_id=56 parent_frame_id=73}
94 {file_location_id=57 parent_frame_id=60}
95 {file_location_id=42 parent_frame_id=94}
96 {file_location_id=58 parent_frame_id=71}
97 {file_location_id=59 parent_frame_id=71}
98 {file_location_id=60 parent_frame_id=60}
99 {file_location_id=42 parent_frame_id=98}
100 {file_location_id=61 parent_frame_id=71}
101 {file_location_id=62 parent_frame_id=60}
102 {file_location_id=34 parent_frame_id=101}
103 {file_location_id=35 parent_frame_id=101}
104 {file_location_id=36 parent_frame_id=101}
105 {file_location_id=37 parent_frame_id=101}
106 {file_location_id=38 parent_frame_id=101}
107 {file_location_id=39 parent_frame_id=101}
108 {file_location_id=40 parent_frame_id=101}
109 {file_location_id=63 parent_frame_id=60}
110 {file_location_id=42 parent_frame_id=109}
111 {file_location_id=64 parent_frame_id=71}
112 {file_location_id=65 parent_frame_id=60}
113 {file_location_id=42 parent_frame_id=112}
114 {file_location_id=66 parent_frame_id=60}
115 {file_location_id=42 parent_frame_id=114}
116 {file_location_id=67 parent_frame_id=71}
117 {file_location_id=68 parent_frame_id=7}
118 {file_location_id=69 parent_frame_id=117}
119 {file_location_id=70 parent_frame_id=117}
120 {file_location_id=71 parent_frame_id=117}
121 {file_location_id=72 parent_frame_id=117}
122 {file_location_id=73 parent_frame_id=117}
123 {file_location_id=74 parent_frame_id=117}
124 {file_location_id=75 parent_frame_id=117}
125 {file_location_id=76 parent_frame_id=6}
126 {file_location_id=77 parent_frame_id=125}
127 {file_location_id=78 parent_frame_id=125}
128 {file_location_id=79 parent_frame_id=125}
129 {file_location_id=80 parent_frame_id=125}
130 {file_location_id=76 parent_frame_id=0}
131 {file_location_id=80 parent_frame_id=130}
132 {file_location_id=81 parent_frame_id=131}
133 {file_location_id=82 parent_frame_id=132}
134 {file_location_id=83 parent_frame_id=133}
135 {file_location_id=84 parent_frame_id=134}
136 {file_location_id=85 parent_frame_id=135}
137 {file_location_id=86 parent_frame_id=136}
138 {file_location_id=87 parent_frame_id=137}
139 {file_location_id=88 parent_frame_id=138}
140 {file_location_id=89 parent_frame_id=138}
141 {file_location_id=90 parent_frame_id=138}
142 {file_location_id=80 parent_frame_id=0}
143 {file_location_id=81 parent_frame_id=142}
144 {file_location_id=82 parent_frame_id=143}
145 {file_location_id=83 parent_frame_id=144}
146 {file_location_id=84 parent_frame_id=145}
147 {file_location_id=85 parent_frame_id=146}
148 {file_location_id=86 parent_frame_id=147}
149 {file_location_id=87 parent_frame_id=148}
150 {file_location_id=90 parent_frame_id=149}
151 {file_location_id=91 parent_frame_id=150}
152 {file_location_id=92 parent_frame_id=150}
153 {file_location_id=93 parent_frame_id=150}
154 {file_location_id=81 parent_frame_id=0}
155 {file_location_id=82 parent_frame_id=154}
156 {file_location_id=83 parent_frame_id=155}
157 {file_location_id=84 parent_frame_id=156}
158 {file_location_id=85 parent_frame_id=157}
159 {file_location_id=86 parent_frame_id=158}
160 {file_location_id=87 parent_frame_id=159}
161 {file_location_id=90 parent_frame_id=160}
162 {file_location_id=94 parent_frame_id=161}
163 {file_location_id=95 parent_frame_id=162}
164 {file_location_id=96 parent_frame_id=162}
165 {file_location_id=94 parent_frame_id=150}
166 {file_location_id=97 parent_frame_id=162}
167 {file_location_id=98 parent_frame_id=162}
168 {file_location_id=99 parent_frame_id=162}
169 {file_location_id=100 parent_frame_id=162}
170 {file_location_id=101 parent_frame_id=162}
171 {file_location_id=102 parent_frame_id=162}
172 {file_location_id=103 parent_frame_id=162}
173 {file_location_id=104 parent_frame_id=162}
174 {file_location_id=105 parent_frame_id=162}
175 {file_location_id=106 parent_frame_id=162}
176 {file_location_id=107 parent_frame_id=150}
177 {file_location_id=108 parent_frame_id=150}
178 {file_location_id=109 parent_frame_id=150}
179 {file_location_id=110 parent_frame_id=150}
180 {file_location_id=111 parent_frame_id=150}
181 {file_location_id=112 parent_frame_id=150}
182 {file_location_id=113 parent_frame_id=150}
183 {file_location_id=114 parent_frame_id=150}
184 {file_location_id=115 parent_frame_id=129}
185 {file_location_id=116 parent_frame_id=5}
186 {file_location_id=117 parent_frame_id=185}
187 {file_location_id=118 parent_frame_id=186}
188 {file_location_id=76 parent_frame_id=57}
189 {file_location_id=80 parent_frame_id=188}
190 {file_location_id=81 parent_frame_id=189}
191 {file_location_id=82 parent_frame_id=190}
192 {file_location_id=83 parent_frame_id=191}
193 {file_location_id=119 parent_frame_id=56}
194 {file_location_id=120 parent_frame_id=193}
195 {file_location_id=121 parent_frame_id=194}
196 {file_location_id=122 parent_frame_id=195}
197 {file_location_id=123 parent_frame_id=196}
198 {file_location_id=124 parent_frame_id=197}
199 {file_location_id=125 parent_frame_id=197}
200 {file_location_id=119 parent_frame_id=5}
201 {file_location_id=120 parent_frame_id=200}
202 {file_location_id=121 parent_frame_id=201}
203 {file_location_id=126 parent_frame_id=202}
204 {file_location_id=127 parent_frame_id=203}
205 {file_location_id=128 parent_frame_id=203}
206 {file_location_id=129 parent_frame_id=203}
207 {file_location_id=130 parent_frame_id=202}
208 {file_location_id=119 parent_frame_id=13}
209 {file_location_id=120 parent_frame_id=208}
210 {file_location_id=121 parent_frame_id=209}
211 {file_location_id=131 parent_frame_id=210}
212 {file_location_id=132 parent_frame_id=211}
213 {file_location_id=133 parent_frame_id=212}
214 {file_location_id=134 parent_frame_id=213}
215 {file_location_id=131 parent_frame_id=195}
216 {file_location_id=132 parent_frame_id=215}
217 {file_location_id=135 parent_frame_id=216}
218 {file_location_id=136 parent_frame_id=202}
219 {file_location_id=137 parent_frame_id=202}
220 {file_location_id=138 parent_frame_id=219}
221 {file_location_id=139 parent_frame_id=219}
222 {file_location_id=140 parent_frame_id=202}
223 {file_location_id=141 parent_frame_id=222}
224 {file_location_id=142 parent_frame_id=222}
225 {file_location_id=143 parent_frame_id=202}
226 {file_location_id=144 parent_frame_id=225}
227 {file_location_id=145 parent_frame_id=186}
228 {file_location_id=146 parent_frame_id=216}


%region_19.23 (psum.6: f32[], psum.7: f32[]) -> f32[] {
  %psum.6 = f32[]{:T(128)} parameter(0), metadata={op_name="psum"}
  %psum.7 = f32[]{:T(128)} parameter(1), metadata={op_name="psum"}
  ROOT %add.382 = f32[]{:T(128)} add(%psum.6, %psum.7), metadata={op_name="add" stack_frame_id=184}, backend_config={"flag_configs":[],"scoped_memory_configs":[],"used_scoped_memory_configs":[],"aliasing_operands":{"lists":[]}}
}

%fused_computation (param_0.2: bf16[128256,4096], param_1.7: s32[32768]) -> bf16[32768,4096] {
  %param_0.2 = bf16[128256,4096]{1,0:T(8,128)(2,1)} parameter(0)
  %param_1.7 = s32[32768]{0:T(1024)S(1)} parameter(1)
  %custom-call.6 = s32[32768]{0:T(1024)} custom-call(%param_1.7), custom_call_target="AssumeGatherIndicesInBound", operand_layout_constraints={s32[32768]{0:T(1024)}}, metadata={op_name="jit(train_step)/train_step/forward_backward/jvp()/gather" stack_frame_id=9}
  %slice.186 = s32[32768]{0:T(1024)} slice(%custom-call.6), slice={[0:32768]}, metadata={op_name="jit(train_step)/train_step/forward_backward/jvp()/gather" stack_frame_id=9}
  %reshape.489 = s32[4,8192]{1,0:T(4,128)} reshape(%slice.186), metadata={op_name="jit(train_step)/train_step/forward_backward/jvp()/broadcast_in_dim" stack_frame_id=9}
  %transpose.163 = s32[4,8192]{1,0:T(4,128)} transpose(%reshape.489), dimensions={0,1}, metadata={op_name="jit(train_step)/train_step/forward_backward/jvp()/broadcast_in_dim" stack_frame_id=9}
  %gather.4 = bf16[4,8192,4096]{2,1,0:T(8,128)(2,1)} gather(%param_0.2, %transpose.163), offset_dims={2}, collapsed_slice_dims={0}, start_index_map={0}, index_vector_dim=2, slice_sizes={1,4096}, metadata={op_name="jit(train_step)/train_step/forward_backward/jvp()/gather" stack_frame_id=9}
  %transpose.162 = bf16[4,8192,4096]{2,1,0:T(8,128)(2,1)} transpose(%gather.4), dimensions={0,1,2}, metadata={op_name="jit(train_step)/train_step/forward_backward/jvp()/gather" stack_frame_id=9}
  ROOT %reshape.488 = bf16[32768,4096]{1,0:T(8,128)(2,1)} reshape(%transpose.162), metadata={op_name="jit(train_step)/train_step/forward_backward/jvp()/gather" stack_frame_id=9}
}

%compare (name: s32[], name.1: s32[], name.2: s32[], name.3: s32[]) -> pred[] {
  %name = s32[] parameter(0)
  %name.1 = s32[] parameter(1)
  %name.2 = s32[] parameter(2)
  %name.3 = s32[] parameter(3)
  %compare.28 = pred[]{:S(6)} compare(%name, %name.1), direction=EQ, backend_config={"flag_configs":[],"scoped_memory_configs":[],"used_scoped_memory_configs":[],"aliasing_operands":{"lists":[]}}
  %compare.29 = pred[]{:S(6)} compare(%name.2, %name.3), direction=LT, backend_config={"flag_configs":[],"scoped_memory_configs":[],"used_scoped_memory_configs":[],"aliasing_operands":{"lists":[]}}
  %compare.30 = pred[]{:S(6)} compare(%name, %name.1), direction=LT, backend_config={"flag_configs":[],"scoped_memory_configs":[],"used_scoped_memory_configs":[],"aliasing_operands":{"lists":[]}}
  ROOT %select.32 = pred[] select(%compare.28, %compare.29, %compare.30), backend_config={"flag_configs":[],"scoped_memory_configs":[],"used_scoped_memory_configs":[],"aliasing_operands":{"lists":[]}}
}

%fused_computation.229 (param_0.580: f32[4096,129024], param_1.624: f32[]) -> f32[4096,128256] {
  %param_0.580 = f32[4096,129024]{0,1:T(8,128)} parameter(0)
  %slice.210 = f32[4096,128256]{0,1:T(8,128)} slice(%param_0.580), slice={[0:4096], [0:128256]}, metadata={op_name="jit(train_step)/train_step/forward_backward/transpose(train_step)/forward_backward/jvp()/shard_map/tokamax:{\"op\":{\"__type\":\"tokamax._src.ops.linear_softmax_cross_entropy_loss.chunked_xla.ChunkedXlaLinearSoftmaxCrossEntropyLossVjp\",\"config\":{\"b_block_size\":1024,\"v_block_size\":2048},\"vjp\":null},\"arguments\":{\"dout\":\"f32[]\",\"labels\":\"i32[32768]\",\"out\":\"f32[]\",\"reduction\":\"sum\",\"residuals\":[\"f32[32768]\"],\"return_residuals\":false,\"w\":\"f32[4096,128256]\",\"x\":\"f32[32768,4096]\"}}/jit(linear_softmax_cross_entropy_loss_bwd_chunked_xla)/slice" stack_frame_id=192}
  %param_1.624 = f32[]{:T(128)} parameter(1)
  %mul.1540 = f32[4096,128256]{0,1:T(8,128)} broadcast(%param_1.624), dimensions={}, metadata={op_name="jit(train_step)/train_step/forward_backward/transpose(train_step)/forward_backward/jvp()/shard_map/tokamax:{\"op\":{\"__type\":\"tokamax._src.ops.linear_softmax_cross_entropy_loss.chunked_xla.ChunkedXlaLinearSoftmaxCrossEntropyLossVjp\",\"config\":{\"b_block_size\":1024,\"v_block_size\":2048},\"vjp\":null},\"arguments\":{\"dout\":\"f32[]\",\"labels\":\"i32[32768]\",\"out\":\"f32[]\",\"reduction\":\"sum\",\"residuals\":[\"f32[32768]\"],\"return_residuals\":false,\"w\":\"f32[4096,128256]\",\"x\":\"f32[32768,4096]\"}}/jit(linear_softmax_cross_entropy_loss_bwd_chunked_xla)/mul" stack_frame_id=192}
  ROOT %mul.1539 = f32[4096,128256]{0,1:T(8,128)} multiply(%slice.210, %mul.1540), metadata={op_name="jit(train_step)/train_step/forward_backward/transpose(train_step)/forward_backward/jvp()/shard_map/tokamax:{\"op\":{\"__type\":\"tokamax._src.ops.linear_softmax_cross_entropy_loss.chunked_xla.ChunkedXlaLinearSoftmaxCrossEntropyLossVjp\",\"config\":{\"b_block_size\":1024,\"v_block_size\":2048},\"vjp\":null},\"arguments\":{\"dout\":\"f32[]\",\"labels\":\"i32[32768]\",\"out\":\"f32[]\",\"reduction\":\"sum\",\"residuals\":[\"f32[32768]\"],\"return_residuals\":false,\"w\":\"f32[4096,128256]\",\"x\":\"f32[32768,4096]\"}}/jit(linear_softmax_cross_entropy_loss_bwd_chunked_xla)/mul" stack_frame_id=192}
}

%fused_computation.230 (param_0.846: bf16[32,14336,512], param_1.1008: f32[], param_2.786: bf16[], param_3.479: bf16[32,14336,512], param_4.309: bf16[32,14336,512], param_5.259: f32[32,14336,512], param_6.230: bf16[32,14336,512], param_7.122: bf16[32,14336,512], param_8.23: bf16[32,14336,512], param_9.6: f32[32,14336,512]) -> (bf16[32,14336,512], bf16[32,14336,512], f32[32,14336,512], bf16[32,14336,512], bf16[32,14336,512], /*index=5*/f32[32,14336,512]) {
  %param_0.846 = bf16[32,14336,512]{2,1,0:T(8,128)(2,1)} parameter(0)
  %convert_element_type.707 = f32[32,14336,512]{2,1,0:T(8,128)} convert(%param_0.846), metadata={op_name="jit(train_step)/train_step/optimizer/convert_element_type" stack_frame_id=187}
  %param_4.309 = bf16[32,14336,512]{2,1,0:T(8,128)(2,1)} parameter(4)
  %constant.1448.clone.1 = bf16[]{:T(256)} constant(0.1001)
  %broadcast.536.clone.1 = bf16[32,14336,512]{2,1,0:T(8,128)(2,1)} broadcast(%constant.1448.clone.1), dimensions={}, metadata={op_name="broadcast.67"}
  %mul.1698.clone.1 = bf16[32,14336,512]{2,1,0:T(8,128)(2,1)} multiply(%param_4.309, %broadcast.536.clone.1), metadata={op_name="jit(train_step)/train_step/optimizer/mul" stack_frame_id=198}
  %convert_element_type.811.clone.1 = f32[32,14336,512]{2,1,0:T(8,128)} convert(%mul.1698.clone.1), metadata={op_name="jit(train_step)/train_step/optimizer/convert_element_type" stack_frame_id=198}
  %param_5.259 = f32[32,14336,512]{2,1,0:T(8,128)} parameter(5)
  %constant.1447.clone.1 = f32[]{:T(128)} constant(0.9)
  %broadcast.535.clone.1 = f32[32,14336,512]{2,1,0:T(8,128)} broadcast(%constant.1447.clone.1), dimensions={}, metadata={op_name="broadcast.66"}
  %mul.1697.clone.1 = f32[32,14336,512]{2,1,0:T(8,128)} multiply(%param_5.259, %broadcast.535.clone.1), metadata={op_name="jit(train_step)/train_step/optimizer/mul" stack_frame_id=199}
  %add.795.clone.1 = f32[32,14336,512]{2,1,0:T(8,128)} add(%convert_element_type.811.clone.1, %mul.1697.clone.1), metadata={op_name="jit(train_step)/train_step/optimizer/add" stack_frame_id=198}
  %param_1.1008 = f32[]{:T(128)S(6)} parameter(1)
  %div.299 = f32[32,14336,512]{2,1,0:T(8,128)} broadcast(%param_1.1008), dimensions={}, metadata={op_name="jit(train_step)/train_step/optimizer/div" stack_frame_id=207}
  %integer_pow.58.clone.1 = bf16[32,14336,512]{2,1,0:T(8,128)(2,1)} multiply(%param_4.309, %param_4.309), metadata={op_name="jit(train_step)/train_step/optimizer/integer_pow" stack_frame_id=214}
  %constant.1446.clone.1 = bf16[]{:T(256)} constant(0.0009995)
  %broadcast.534.clone.1 = bf16[32,14336,512]{2,1,0:T(8,128)(2,1)} broadcast(%constant.1446.clone.1), dimensions={}, metadata={op_name="broadcast.59"}
  %mul.1696.clone.1 = bf16[32,14336,512]{2,1,0:T(8,128)(2,1)} multiply(%integer_pow.58.clone.1, %broadcast.534.clone.1), metadata={op_name="jit(train_step)/train_step/optimizer/mul" stack_frame_id=217}
  %param_3.479 = bf16[32,14336,512]{2,1,0:T(8,128)(2,1)} parameter(3)
  %add.794.clone.1 = bf16[32,14336,512]{2,1,0:T(8,128)(2,1)} add(%mul.1696.clone.1, %param_3.479), metadata={op_name="jit(train_step)/train_step/optimizer/add" stack_frame_id=217}
  %param_2.786 = bf16[]{:T(256)S(6)} parameter(2)
  %div.307 = bf16[32,14336,512]{2,1,0:T(8,128)(2,1)} broadcast(%param_2.786), dimensions={}, metadata={op_name="jit(train_step)/train_step/optimizer/div" stack_frame_id=218}
  %div.297 = bf16[32,14336,512]{2,1,0:T(8,128)(2,1)} divide(%add.794.clone.1, %div.307), metadata={op_name="jit(train_step)/train_step/optimizer/div" stack_frame_id=218}
  %sqrt.39 = bf16[32,14336,512]{2,1,0:T(8,128)(2,1)} sqrt(%div.297), metadata={op_name="jit(train_step)/train_step/optimizer/sqrt" stack_frame_id=220}
  %constant.1360 = bf16[]{:T(256)} constant(1.001e-08)
  %broadcast.454 = bf16[32,14336,512]{2,1,0:T(8,128)(2,1)} broadcast(%constant.1360), dimensions={}, metadata={op_name="broadcast.54"}
  %add.710 = bf16[32,14336,512]{2,1,0:T(8,128)(2,1)} add(%sqrt.39, %broadcast.454), metadata={op_name="jit(train_step)/train_step/optimizer/add" stack_frame_id=220}
  %convert_element_type.705 = f32[32,14336,512]{2,1,0:T(8,128)} convert(%add.710), metadata={op_name="jit(train_step)/train_step/optimizer/convert_element_type" stack_frame_id=221}
  %multiply.171 = f32[32,14336,512]{2,1,0:T(8,128)} multiply(%div.299, %convert_element_type.705), metadata={op_name="multiply.37"}
  %div.294 = f32[32,14336,512]{2,1,0:T(8,128)} divide(%add.795.clone.1, %multiply.171), metadata={op_name="jit(train_step)/train_step/optimizer/div" stack_frame_id=221}
  %constant.1425 = bf16[]{:T(256)} constant(0), metadata={op_name="jit(train_step)/train_step/forward_backward/transpose(jvp())/scatter-add" stack_frame_id=9}
  %broadcast.460 = bf16[32,14336,512]{2,1,0:T(8,128)(2,1)} broadcast(%constant.1425), dimensions={}, metadata={op_name="broadcast.75"}
  %mul.1575 = bf16[32,14336,512]{2,1,0:T(8,128)(2,1)} multiply(%param_0.846, %broadcast.460), metadata={op_name="jit(train_step)/train_step/optimizer/mul" stack_frame_id=223}
  %convert_element_type.704 = f32[32,14336,512]{2,1,0:T(8,128)} convert(%mul.1575), metadata={op_name="jit(train_step)/train_step/optimizer/convert_element_type" stack_frame_id=224}
  %add.702 = f32[32,14336,512]{2,1,0:T(8,128)} add(%div.294, %convert_element_type.704), metadata={op_name="jit(train_step)/train_step/optimizer/add" stack_frame_id=224}
  %constant.1347 = f32[]{:T(128)} constant(-1e-05)
  %broadcast.450 = f32[32,14336,512]{2,1,0:T(8,128)} broadcast(%constant.1347), dimensions={}, metadata={op_name="broadcast.49"}
  %mul.1541 = f32[32,14336,512]{2,1,0:T(8,128)} multiply(%add.702, %broadcast.450), metadata={op_name="jit(train_step)/train_step/optimizer/mul" stack_frame_id=226}
  %add.701 = f32[32,14336,512]{2,1,0:T(8,128)} add(%convert_element_type.707, %mul.1541), metadata={op_name="jit(train_step)/train_step/optimizer/add" stack_frame_id=187}
  %convert_element_type.703 = bf16[32,14336,512]{2,1,0:T(8,128)(2,1)} convert(%add.701), metadata={op_name="jit(train_step)/train_step/optimizer/convert_element_type" stack_frame_id=227}
  %param_6.230 = bf16[32,14336,512]{2,1,0:T(8,128)(2,1)} parameter(6)
  %convert_element_type.712.clone.1 = f32[32,14336,512]{2,1,0:T(8,128)} convert(%param_6.230), metadata={op_name="jit(train_step)/train_step/optimizer/convert_element_type" stack_frame_id=187}
  %param_8.23 = bf16[32,14336,512]{2,1,0:T(8,128)(2,1)} parameter(8)
  %mul.1701.clone.1.clone.1 = bf16[32,14336,512]{2,1,0:T(8,128)(2,1)} multiply(%param_8.23, %broadcast.536.clone.1), metadata={op_name="jit(train_step)/train_step/optimizer/mul" stack_frame_id=198}
  %convert_element_type.812.clone.1.clone.1 = f32[32,14336,512]{2,1,0:T(8,128)} convert(%mul.1701.clone.1.clone.1), metadata={op_name="jit(train_step)/train_step/optimizer/convert_element_type" stack_frame_id=198}
  %param_9.6 = f32[32,14336,512]{2,1,0:T(8,128)} parameter(9)
  %mul.1700.clone.1.clone.1 = f32[32,14336,512]{2,1,0:T(8,128)} multiply(%param_9.6, %broadcast.535.clone.1), metadata={op_name="jit(train_step)/train_step/optimizer/mul" stack_frame_id=199}
  %add.797.clone.1.clone.1 = f32[32,14336,512]{2,1,0:T(8,128)} add(%convert_element_type.812.clone.1.clone.1, %mul.1700.clone.1.clone.1), metadata={op_name="jit(train_step)/train_step/optimizer/add" stack_frame_id=198}
  %integer_pow.59.clone.1.clone.1 = bf16[32,14336,512]{2,1,0:T(8,128)(2,1)} multiply(%param_8.23, %param_8.23), metadata={op_name="jit(train_step)/train_step/optimizer/integer_pow" stack_frame_id=214}
  %mul.1699.clone.1.clone.1 = bf16[32,14336,512]{2,1,0:T(8,128)(2,1)} multiply(%integer_pow.59.clone.1.clone.1, %broadcast.534.clone.1), metadata={op_name="jit(train_step)/train_step/optimizer/mul" stack_frame_id=217}
  %param_7.122 = bf16[32,14336,512]{2,1,0:T(8,128)(2,1)} parameter(7)
  %add.796.clone.1.clone.1 = bf16[32,14336,512]{2,1,0:T(8,128)(2,1)} add(%mul.1699.clone.1.clone.1, %param_7.122), metadata={op_name="jit(train_step)/train_step/optimizer/add" stack_frame_id=217}
  %div.298.clone.1 = bf16[32,14336,512]{2,1,0:T(8,128)(2,1)} divide(%add.796.clone.1.clone.1, %div.307), metadata={op_name="jit(train_step)/train_step/optimizer/div" stack_frame_id=218}
  %sqrt.40.clone.1 = bf16[32,14336,512]{2,1,0:T(8,128)(2,1)} sqrt(%div.298.clone.1), metadata={op_name="jit(train_step)/train_step/optimizer/sqrt" stack_frame_id=220}
  %add.712.clone.1 = bf16[32,14336,512]{2,1,0:T(8,128)(2,1)} add(%sqrt.40.clone.1, %broadcast.454), metadata={op_name="jit(train_step)/train_step/optimizer/add" stack_frame_id=220}
  %convert_element_type.710.clone.1 = f32[32,14336,512]{2,1,0:T(8,128)} convert(%add.712.clone.1), metadata={op_name="jit(train_step)/train_step/optimizer/convert_element_type" stack_frame_id=221}
  %multiply.172.clone.1 = f32[32,14336,512]{2,1,0:T(8,128)} multiply(%div.299, %convert_element_type.710.clone.1), metadata={op_name="multiply.36"}
  %div.295.clone.1 = f32[32,14336,512]{2,1,0:T(8,128)} divide(%add.797.clone.1.clone.1, %multiply.172.clone.1), metadata={op_name="jit(train_step)/train_step/optimizer/div" stack_frame_id=221}
  %mul.1578.clone.1 = bf16[32,14336,512]{2,1,0:T(8,128)(2,1)} multiply(%param_6.230, %broadcast.460), metadata={op_name="jit(train_step)/train_step/optimizer/mul" stack_frame_id=223}
  %convert_element_type.709.clone.1 = f32[32,14336,512]{2,1,0:T(8,128)} convert(%mul.1578.clone.1), metadata={op_name="jit(train_step)/train_step/optimizer/convert_element_type" stack_frame_id=224}
  %add.705.clone.1 = f32[32,14336,512]{2,1,0:T(8,128)} add(%div.295.clone.1, %convert_element_type.709.clone.1), metadata={op_name="jit(train_step)/train_step/optimizer/add" stack_frame_id=224}
  %mul.1543.clone.1 = f32[32,14336,512]{2,1,0:T(8,128)} multiply(%add.705.clone.1, %broadcast.450), metadata={op_name="jit(train_step)/train_step/optimizer/mul" stack_frame_id=226}
  %add.704.clone.1 = f32[32,14336,512]{2,1,0:T(8,128)} add(%convert_element_type.712.clone.1, %mul.1543.clone.1), metadata={op_name="jit(train_step)/train_step/optimizer/add" stack_frame_id=187}
  %convert_element_type.708.clone.1 = bf16[32,14336,512]{2,1,0:T(8,128)(2,1)} convert(%add.704.clone.1), metadata={op_name="jit(train_step)/train_step/optimizer/convert_element_type" stack_frame_id=227}
  ROOT %tuple.254 = (bf16[32,14336,512]{2,1,0:T(8,128)(2,1)}, bf16[32,14336,512]{2,1,0:T(8,128)(2,1)}, f32[32,14336,512]{2,1,0:T(8,128)}, bf16[32,14336,512]{2,1,0:T(8,128)(2,1)}, bf16[32,14336,512]{2,1,0:T(8,128)(2,1)}, /*index=5*/f32[32,14336,512]{2,1,0:T(8,128)}) tuple(%convert_element_type.703, %add.794.clone.1, %add.795.clone.1, %convert_element_type.708.clone.1, %add.796.clone.1.clone.1, /*index=5*/%add.797.clone.1.clone.1)
}

%fused_computation.234 (param_0.852: bf16[32,512,14336], param_1.1014: f32[], param_2.790: bf16[], param_3.483: bf16[32,512,14336], param_4.315: bf16[32,512,14336], param_5.269: f32[32,512,14336]) -> (bf16[32,512,14336], bf16[32,512,14336], f32[32,512,14336]) {
  %param_0.852 = bf16[32,512,14336]{2,1,0:T(8,128)(2,1)} parameter(0)
  %convert_element_type.717 = f32[32,512,14336]{2,1,0:T(8,128)} convert(%param_0.852), metadata={op_name="jit(train_step)/train_step/optimizer/convert_element_type" stack_frame_id=187}
  %param_4.315 = bf16[32,512,14336]{2,1,0:T(8,128)(2,1)} parameter(4)
  %constant.1454.clone.1 = bf16[]{:T(256)} constant(0.1001)
  %mul.1707.clone.1 = bf16[32,512,14336]{2,1,0:T(8,128)(2,1)} broadcast(%constant.1454.clone.1), dimensions={}, metadata={op_name="jit(train_step)/train_step/optimizer/mul" stack_frame_id=198}
  %mul.1706.clone.1 = bf16[32,512,14336]{2,1,0:T(8,128)(2,1)} multiply(%param_4.315, %mul.1707.clone.1), metadata={op_name="jit(train_step)/train_step/optimizer/mul" stack_frame_id=198}
  %convert_element_type.813.clone.1 = f32[32,512,14336]{2,1,0:T(8,128)} convert(%mul.1706.clone.1), metadata={op_name="jit(train_step)/train_step/optimizer/convert_element_type" stack_frame_id=198}
  %param_5.269 = f32[32,512,14336]{2,1,0:T(8,128)} parameter(5)
  %constant.1453.clone.1 = f32[]{:T(128)} constant(0.9)
  %mul.1705.clone.1 = f32[32,512,14336]{2,1,0:T(8,128)} broadcast(%constant.1453.clone.1), dimensions={}, metadata={op_name="jit(train_step)/train_step/optimizer/mul" stack_frame_id=199}
  %mul.1704.clone.1 = f32[32,512,14336]{2,1,0:T(8,128)} multiply(%param_5.269, %mul.1705.clone.1), metadata={op_name="jit(train_step)/train_step/optimizer/mul" stack_frame_id=199}
  %add.799.clone.1 = f32[32,512,14336]{2,1,0:T(8,128)} add(%convert_element_type.813.clone.1, %mul.1704.clone.1), metadata={op_name="jit(train_step)/train_step/optimizer/add" stack_frame_id=198}
  %param_1.1014 = f32[]{:T(128)S(6)} parameter(1)
  %div.302 = f32[32,512,14336]{2,1,0:T(8,128)} broadcast(%param_1.1014), dimensions={}, metadata={op_name="jit(train_step)/train_step/optimizer/div" stack_frame_id=207}
  %integer_pow.60.clone.1 = bf16[32,512,14336]{2,1,0:T(8,128)(2,1)} multiply(%param_4.315, %param_4.315), metadata={op_name="jit(train_step)/train_step/optimizer/integer_pow" stack_frame_id=214}
  %constant.1452.clone.1 = bf16[]{:T(256)} constant(0.0009995)
  %mul.1703.clone.1 = bf16[32,512,14336]{2,1,0:T(8,128)(2,1)} broadcast(%constant.1452.clone.1), dimensions={}, metadata={op_name="jit(train_step)/train_step/optimizer/mul" stack_frame_id=217}
  %mul.1702.clone.1 = bf16[32,512,14336]{2,1,0:T(8,128)(2,1)} multiply(%integer_pow.60.clone.1, %mul.1703.clone.1), metadata={op_name="jit(train_step)/train_step/optimizer/mul" stack_frame_id=217}
  %param_3.483 = bf16[32,512,14336]{2,1,0:T(8,128)(2,1)} parameter(3)
  %add.798.clone.1 = bf16[32,512,14336]{2,1,0:T(8,128)(2,1)} add(%mul.1702.clone.1, %param_3.483), metadata={op_name="jit(train_step)/train_step/optimizer/add" stack_frame_id=217}
  %param_2.790 = bf16[]{:T(256)S(6)} parameter(2)
  %div.309 = bf16[32,512,14336]{2,1,0:T(8,128)(2,1)} broadcast(%param_2.790), dimensions={}, metadata={op_name="jit(train_step)/train_step/optimizer/div" stack_frame_id=218}
